 
Процедура ОбработкаПроведения(Отказ, Режим)
	//=============================================================
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Склад 			= Склад;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.ВидОпераций    = ВидОпераций;
		Движение.Количество 	= ТекСтрокаТовары.Количество;
		
	КонецЦикла;
   //============================================================

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		НомерИсхДокумента = ДанныеЗаполнения.Номер;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ВидОпераций = Перечисления.ВидыОперации.Реализация;
		Склад = ДанныеЗаполнения.МестоХранения;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдИзм = ТекСтрокаТовары.ЕдИзм;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


  